* Python 2&3 中的字符串

** str/bytes/unicode

#+BEGIN_SRC python2
import sys
print sys.version_info.major
a = 'aha'
b = b'aha'
c = u'aha'
print 'a:', a, type(a)
print 'b:', b, type(b)
print 'c:', c, type(c)
print a == b == c
#+END_SRC

#+RESULTS:
: 2
: a: aha <type 'str'>
: b: aha <type 'str'>
: c: aha <type 'unicode'>
: True

#+begin_src python3
import sys
print(sys.version_info.major)
a = 'aha'
b = b'aha'
c = u'aha'
print(a, type(a))
print(b, type(b))
print(c, type(c))
print(a == b)
print(a == c)
print(b == c)
#+end_src

#+RESULTS:
: 3
: aha <class 'str'>
: b'aha' <class 'bytes'>
: aha <class 'str'>
: False
: True
: False
